# Реализовать структуру данных «Товары». Она должна представлять собой список кортежей.
# Каждый кортеж хранит информацию об отдельном товаре.
# В кортеже должно быть два элемента — номер товара и словарь с параметрами
# (характеристиками товара: название, цена, количество, единица измерения).
# Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
# Пример готовой структуры:
# [
#     (1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
#     (2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
#     (3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})
# ]
# Необходимо собрать аналитику о товарах.
# Реализовать словарь, в котором каждый ключ — характеристика товара,
# например название, а значение — список значений-характеристик, например список названий товаров.
# Пример:
# {
#     “название”: [“компьютер”, “принтер”, “сканер”],
#     “цена”: [20000, 6000, 2000],
#     “количество”: [5, 2, 7],
#     “ед”: [“шт.”]
# }
my_list = []
result = {}
i = 1
for i in range(1, 4):
    user_name = input('Введите название техники: ')
    key = 'Название'
    result[key] = user_name
    user_cost = int(input('Введите цену техники: '))
    key = 'Цена'
    result[key] = user_cost
    user_amount = int(input('Введите количество техники: '))
    key = 'Количество'
    result[key] = user_amount
    user_measure = input('Введите единицу измерения: ')
    key = 'ед.'
    result[key] = user_measure
    result1 = result.copy()
    my_list.append(result1)


print(my_list)

for j in enumerate(my_list, 1):
    print(j)

# my_list = [{'Название': 'Компьютер', 'Цена': 20000, 'Количество': 5, 'ед.': 'шт.'},
#     {'Название': 'Принтер', 'Цена': 6000, 'Количество': 2, 'ед.': 'шт.'},
#      {'Название': 'Сканер', 'Цена': 2000, 'Количество': 7, 'ед.': 'шт.'}]

analitika = {}
list_name = []
list_cost = []
list_amount = []
list_measure = []
for i in my_list:
    list_name.append(i['Название'])
    list_cost.append(i['Цена'])
    list_amount.append(i['Количество'])
    if i['ед.'] not in list_measure:
        list_measure.append(i['ед.'])
print(list_name)
print(list_cost)
print(list_amount)
print(list_measure)

for i in range(1, 5):
    key = 'Название'
    analitika[key] = list_name
    key = 'Цена'
    analitika[key] = list_cost
    key = 'Количество'
    analitika[key] = list_amount
    key = 'ед.'
    analitika[key] = list_measure

print(analitika)
